BaiTian6641/qemu/hw/misc/esp32s3_bt.c
/*
 * ESP32-S3 BLE Controller Model
 *
 * Copyright (c) 2024 Espressif Systems (Shanghai) Co. Ltd.
 *
 * Sprint S6: BLE Controller MVP
 *  - S6-T1: BT register model (R/W store at 0x60011000, 7 IRQs)
 *  - S6-T2: VHCI transport (QEMU HCI registers at 0xF00-0xFFF)
 *  - S6-T3: Virtual BLE peer (deterministic adv/scan/connect)
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 or
 * (at your option) any later version.
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/timer.h"
#include "hw/irq.h"
#include "hw/sysbus.h"
#include "hw/misc/esp32s3_bt.h"

/* ================================================================== */
/*  Forward declarations                                               */
/* ================================================================== */
static void bt_hci_process_command(ESP32S3BtState *s);
static void bt_acl_process(ESP32S3BtState *s);
static void bt_hci_enqueue_rx(ESP32S3BtState *s,
                              const uint8_t *data, uint16_t len);
static void bt_update_irq(ESP32S3BtState *s);
static void bt_scan_timer_cb(void *opaque);

/* ================================================================== */
/*  IRQ helpers                                                        */
/* ================================================================== */
static void bt_update_irq(ESP32S3BtState *s)
{
    uint32_t pending = s->int_raw & s->int_ena;
    /* Route HCI-related interrupts through RWBLE (index 4) */
    qemu_set_irq(s->irq[ESP32S3_BT_IRQ_RWBLE], pending ? 1 : 0);
}

/* ================================================================== */
/*  HCI RX queue management                                            */
/* ================================================================== */
static void bt_hci_enqueue_rx(ESP32S3BtState *s,
                              const uint8_t *data, uint16_t len)
{
    if (s->rx_count >= BT_HCI_RX_QUEUE_DEPTH) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: RX queue overflow, dropping packet\n", __func__);
        return;
    }
    BtHciRxPacket *pkt = g_new0(BtHciRxPacket, 1);
    memcpy(pkt->data, data, MIN(len, BT_HCI_RX_BUF_SIZE));
    pkt->len = MIN(len, BT_HCI_RX_BUF_SIZE);
    QTAILQ_INSERT_TAIL(&s->rx_queue, pkt, entry);
    s->rx_count++;

    /* Signal RX ready interrupt */
    s->int_raw |= BT_HCI_INT_RX_READY;
    bt_update_irq(s);
}

/* ================================================================== */
/*  HCI event builders                                                 */
/* ================================================================== */

/* Build Command Complete event: H4(0x04) + Evt(0x0E) + Len + NumPkts + Opcode + Status + params */
static void bt_send_cmd_complete(ESP32S3BtState *s, uint16_t opcode,
                                 uint8_t status,
                                 const uint8_t *params, uint8_t param_len)
{
    uint8_t buf[BT_HCI_RX_BUF_SIZE];
    int pos = 0;

    buf[pos++] = HCI_H4_EVT;
    buf[pos++] = HCI_EVT_CMD_COMPLETE;
    buf[pos++] = 3 + 1 + param_len;  /* param total length */
    buf[pos++] = s->num_hci_cmd_pkts; /* Num_HCI_Command_Packets */
    buf[pos++] = opcode & 0xFF;
    buf[pos++] = (opcode >> 8) & 0xFF;
    buf[pos++] = status;
    if (param_len > 0 && params) {
        memcpy(&buf[pos], params, param_len);
        pos += param_len;
    }
    bt_hci_enqueue_rx(s, buf, pos);
}

/* Build Command Status event */
static void bt_send_cmd_status(ESP32S3BtState *s, uint16_t opcode,
                               uint8_t status)
{
    uint8_t buf[8];
    int pos = 0;
    buf[pos++] = HCI_H4_EVT;
    buf[pos++] = HCI_EVT_CMD_STATUS;
    buf[pos++] = 4;   /* parameter length */
    buf[pos++] = status;
    buf[pos++] = s->num_hci_cmd_pkts;
    buf[pos++] = opcode & 0xFF;
    buf[pos++] = (opcode >> 8) & 0xFF;
    bt_hci_enqueue_rx(s, buf, pos);
}

/* Build LE Meta Event */
static void bt_send_le_meta(ESP32S3BtState *s, uint8_t sub_event,
                            const uint8_t *params, uint8_t param_len)
{
    uint8_t buf[BT_HCI_RX_BUF_SIZE];
    int pos = 0;
    buf[pos++] = HCI_H4_EVT;
    buf[pos++] = HCI_EVT_LE_META;
    buf[pos++] = 1 + param_len;  /* sub_event + params */
    buf[pos++] = sub_event;
    if (param_len > 0 && params) {
        memcpy(&buf[pos], params, param_len);
        pos += param_len;
    }
    bt_hci_enqueue_rx(s, buf, pos);
}

/* ================================================================== */
/*  Virtual BLE Peer — Advertising report generation                   */
/* ================================================================== */
static void bt_generate_adv_report(ESP32S3BtState *s)
{
    /*
     * LE Advertising Report sub-event:
     *  Num_Reports(1) + Event_Type(1) + Address_Type(1) + Address(6) +
     *  Length_Data(1) + Data(N) + RSSI(1)
     *
     * We generate one report from the virtual peer with a complete local name.
     */
    const char *name = BT_VIRT_PEER_ADV_NAME;
    uint8_t name_len = strlen(name);
    uint8_t params[64];
    int pos = 0;

    params[pos++] = 1;            /* Num_Reports */
    params[pos++] = 0x00;         /* Event_Type: ADV_IND (connectable undirected) */
    params[pos++] = 0x01;         /* Address_Type: Random */
    /* Peer address (little-endian) */
    params[pos++] = 0x02; params[pos++] = 0x00; params[pos++] = 0x00;
    params[pos++] = 0x00; params[pos++] = 0x00; params[pos++] = 0x02;
    params[pos++] = 1 + name_len + 1;  /* Length_Data: type + name */
    params[pos++] = name_len + 1;      /* AD Length */
    params[pos++] = 0x09;              /* AD Type: Complete Local Name */
    memcpy(&params[pos], name, name_len);
    pos += name_len;
    params[pos++] = (uint8_t)(int8_t)BT_VIRT_PEER_RSSI;  /* RSSI */

    bt_send_le_meta(s, HCI_LE_EVT_ADV_REPORT, params, pos);
}

static void bt_scan_timer_cb(void *opaque)
{
    ESP32S3BtState *s = opaque;
    if (!s->scan_enabled || !s->controller_ready) {
        return;
    }
    bt_generate_adv_report(s);

    /* Re-arm timer: ~100 ms interval (virtual clock) */
    timer_mod(s->scan_timer,
              qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 100 * SCALE_MS);
}

