BaiTian6641/qemu/hw/misc/esp32s3_bt.c
/* ================================================================== */
/*  Virtual GATT Database (S7-T1)                                      */
/*  Minimal service table for the virtual BLE peer.                    */
/*  Handle | UUID16 | Properties | Value                               */
/* ================================================================== */

/* GATT attribute entry */
typedef struct {
    uint16_t handle;
    uint16_t uuid16;
    uint8_t  properties;  /* for characteristic decl: R/W/N flags */
    const uint8_t *value;
    uint8_t  value_len;
    uint16_t end_group_handle;  /* for service decl only */
} GattAttr;

/* Characteristic property bits */
#define GATT_PROP_READ      0x02
#define GATT_PROP_WRITE     0x08
#define GATT_PROP_NOTIFY    0x10

static const uint8_t gap_device_name[] = "QEMU_BLE";
static const uint8_t gap_appearance[] = {0x00, 0x00};  /* Unknown */

/* The virtual GATT database:
 *  Handles 1-5:   GAP Service (0x1800) — Device Name + Appearance
 *  Handles 6-7:   GATT Service (0x1801)
 *  Handles 8-14:  Custom QEMU Service (0xFF00) — R/W char + Notify char
 */
#define GATT_DB_SIZE 14

static GattAttr gatt_db[GATT_DB_SIZE] = {
    /* GAP Service: handle 1-5 */
    { .handle = 0x0001, .uuid16 = UUID_PRIMARY_SERVICE, .value = (const uint8_t *)"\x00\x18", .value_len = 2, .end_group_handle = 0x0005 },
    { .handle = 0x0002, .uuid16 = UUID_CHARACTERISTIC, .properties = GATT_PROP_READ },
    { .handle = 0x0003, .uuid16 = UUID_DEVICE_NAME, .value = gap_device_name, .value_len = sizeof(gap_device_name) - 1 },
    { .handle = 0x0004, .uuid16 = UUID_CHARACTERISTIC, .properties = GATT_PROP_READ },
    { .handle = 0x0005, .uuid16 = UUID_APPEARANCE, .value = gap_appearance, .value_len = 2 },

    /* GATT Service: handle 6-7 */
    { .handle = 0x0006, .uuid16 = UUID_PRIMARY_SERVICE, .value = (const uint8_t *)"\x01\x18", .value_len = 2, .end_group_handle = 0x0007 },
    { .handle = 0x0007, .uuid16 = UUID_CHARACTERISTIC, .properties = 0 },  /* placeholder */

    /* Custom QEMU Service: handle 8-14 */
    { .handle = 0x0008, .uuid16 = UUID_PRIMARY_SERVICE, .value = (const uint8_t *)"\x00\xFF", .value_len = 2, .end_group_handle = 0x000E },
    { .handle = 0x0009, .uuid16 = UUID_CHARACTERISTIC, .properties = GATT_PROP_READ | GATT_PROP_WRITE },
    { .handle = 0x000A, .uuid16 = UUID_QEMU_RW_CHAR },   /* R/W value (dynamic) */
    { .handle = 0x000B, .uuid16 = UUID_CHARACTERISTIC, .properties = GATT_PROP_READ | GATT_PROP_NOTIFY },
    { .handle = 0x000C, .uuid16 = UUID_QEMU_NOTIFY_CHAR },  /* Notify value */
    { .handle = 0x000D, .uuid16 = UUID_CCC_DESCRIPTOR },     /* CCC descriptor */
    { .handle = 0x000E, .uuid16 = 0x0000 },  /* End marker */
};

static const GattAttr *gatt_find_by_handle(uint16_t handle)
{
    for (int i = 0; i < GATT_DB_SIZE; i++) {
        if (gatt_db[i].handle == handle) {
            return &gatt_db[i];
        }
    }
    return NULL;
}

/* ================================================================== */
/*  ACL / L2CAP / ATT processing (S7-T1)                              */
/* ================================================================== */

/* Send an ACL data packet (controller → host) */
static void bt_send_acl(ESP32S3BtState *s, uint16_t conn_handle,
                        uint16_t l2cap_cid,
                        const uint8_t *payload, uint16_t payload_len)
{
    uint8_t buf[BT_HCI_RX_BUF_SIZE];
    int pos = 0;
    uint16_t l2cap_len = payload_len;
    uint16_t acl_len = 4 + l2cap_len;  /* L2CAP header (4) + payload */

    buf[pos++] = HCI_H4_ACL;
    /* ACL header: handle (12-bit) + PB=0x02 (first-auto) + BC=0x00 */
    uint16_t hdr = (conn_handle & 0x0FFF) | (0x02 << 12);
    buf[pos++] = hdr & 0xFF;
    buf[pos++] = (hdr >> 8) & 0xFF;
    buf[pos++] = acl_len & 0xFF;
    buf[pos++] = (acl_len >> 8) & 0xFF;
    /* L2CAP header */
    buf[pos++] = l2cap_len & 0xFF;
    buf[pos++] = (l2cap_len >> 8) & 0xFF;
    buf[pos++] = l2cap_cid & 0xFF;
    buf[pos++] = (l2cap_cid >> 8) & 0xFF;
    /* Payload */
    if (payload_len > 0 && payload) {
        memcpy(&buf[pos], payload, MIN(payload_len,
               (uint16_t)(BT_HCI_RX_BUF_SIZE - pos)));
        pos += MIN(payload_len, (uint16_t)(BT_HCI_RX_BUF_SIZE - pos));
    }
    bt_hci_enqueue_rx(s, buf, pos);
}

/* Send ATT Error Response */
static void bt_att_error(ESP32S3BtState *s, uint8_t req_opcode,
                         uint16_t handle, uint8_t error_code)
{
    uint8_t rsp[5];
    rsp[0] = ATT_ERROR_RSP;
    rsp[1] = req_opcode;
    rsp[2] = handle & 0xFF;
    rsp[3] = (handle >> 8) & 0xFF;
    rsp[4] = error_code;
    bt_send_acl(s, s->conn_handle, L2CAP_CID_ATT, rsp, 5);
}

/* Handle ATT protocol PDU */
static void bt_att_handle(ESP32S3BtState *s, const uint8_t *att,
                          uint16_t att_len)
{
    if (att_len < 1) return;
    uint8_t opcode = att[0];

    switch (opcode) {

    case ATT_EXCHANGE_MTU_REQ: {
        if (att_len < 3) return;
        uint16_t client_mtu = att[1] | (att[2] << 8);
        s->att_mtu = MIN(client_mtu, 247);  /* Cap at 247 */
        if (s->att_mtu < 23) s->att_mtu = 23;
        uint8_t rsp[3];
        rsp[0] = ATT_EXCHANGE_MTU_RSP;
        rsp[1] = s->att_mtu & 0xFF;
        rsp[2] = (s->att_mtu >> 8) & 0xFF;
        bt_send_acl(s, s->conn_handle, L2CAP_CID_ATT, rsp, 3);
        break;
    }

    case ATT_READ_BY_GROUP_TYPE_REQ: {
        /* Primary service discovery: UUID = 0x2800 */
        if (att_len < 7) return;
        uint16_t start = att[1] | (att[2] << 8);
        uint16_t end   = att[3] | (att[4] << 8);
        uint16_t uuid  = att[5] | (att[6] << 8);

        if (uuid != UUID_PRIMARY_SERVICE) {
            bt_att_error(s, opcode, start, ATT_ERR_ATTR_NOT_FOUND);
            break;
        }

        /* Find services in range */
        uint8_t rsp[64];
        int pos = 0;
        rsp[pos++] = ATT_READ_BY_GROUP_TYPE_RSP;
        rsp[pos++] = 6;  /* length per entry: start(2) + end(2) + uuid16(2) */
        bool found = false;

        for (int i = 0; i < GATT_DB_SIZE; i++) {
            if (gatt_db[i].uuid16 == UUID_PRIMARY_SERVICE &&
                gatt_db[i].handle >= start &&
                gatt_db[i].handle <= end) {
                if (pos + 6 > (int)sizeof(rsp)) break;
                rsp[pos++] = gatt_db[i].handle & 0xFF;
                rsp[pos++] = (gatt_db[i].handle >> 8) & 0xFF;
                rsp[pos++] = gatt_db[i].end_group_handle & 0xFF;
                rsp[pos++] = (gatt_db[i].end_group_handle >> 8) & 0xFF;
                if (gatt_db[i].value && gatt_db[i].value_len >= 2) {
                    rsp[pos++] = gatt_db[i].value[0];
                    rsp[pos++] = gatt_db[i].value[1];
                } else {
                    rsp[pos++] = 0;
                    rsp[pos++] = 0;
                }
                found = true;
            }
        }
        if (!found) {
            bt_att_error(s, opcode, start, ATT_ERR_ATTR_NOT_FOUND);
        } else {
            bt_send_acl(s, s->conn_handle, L2CAP_CID_ATT, rsp, pos);
        }
        break;
    }

