BaiTian6641/qemu/hw/misc/esp32s3_bt.c
    case ATT_READ_BY_TYPE_REQ: {
        /* Characteristic discovery: UUID = 0x2803 */
        if (att_len < 7) return;
        uint16_t start = att[1] | (att[2] << 8);
        uint16_t end   = att[3] | (att[4] << 8);
        uint16_t uuid  = att[5] | (att[6] << 8);

        uint8_t rsp[64];
        int pos = 0;
        rsp[pos++] = ATT_READ_BY_TYPE_RSP;
        bool found = false;

        if (uuid == UUID_CHARACTERISTIC) {
            rsp[pos++] = 7;  /* handle(2) + props(1) + val_handle(2) + uuid16(2) */
            for (int i = 0; i < GATT_DB_SIZE; i++) {
                if (gatt_db[i].uuid16 == UUID_CHARACTERISTIC &&
                    gatt_db[i].handle >= start &&
                    gatt_db[i].handle <= end &&
                    gatt_db[i].properties != 0) {
                    if (pos + 7 > (int)sizeof(rsp)) break;
                    /* Handle of this declaration */
                    rsp[pos++] = gatt_db[i].handle & 0xFF;
                    rsp[pos++] = (gatt_db[i].handle >> 8) & 0xFF;
                    /* Properties */
                    rsp[pos++] = gatt_db[i].properties;
                    /* Value handle (next handle) */
                    uint16_t vh = gatt_db[i].handle + 1;
                    rsp[pos++] = vh & 0xFF;
                    rsp[pos++] = (vh >> 8) & 0xFF;
                    /* UUID of the value (from next entry) */
                    if (i + 1 < GATT_DB_SIZE) {
                        rsp[pos++] = gatt_db[i + 1].uuid16 & 0xFF;
                        rsp[pos++] = (gatt_db[i + 1].uuid16 >> 8) & 0xFF;
                    } else {
                        rsp[pos++] = 0;
                        rsp[pos++] = 0;
                    }
                    found = true;
                }
            }
        } else {
            /* Read by specific UUID — find value attributes with matching UUID */
            rsp[pos++] = 0;  /* placeholder for length, will be filled */
            for (int i = 0; i < GATT_DB_SIZE; i++) {
                if (gatt_db[i].uuid16 == uuid &&
                    gatt_db[i].handle >= start &&
                    gatt_db[i].handle <= end) {
                    const GattAttr *a = &gatt_db[i];
                    uint8_t vlen = a->value ? a->value_len : 0;
                    if (a->uuid16 == UUID_QEMU_RW_CHAR) {
                        vlen = s->rw_char_len;
                    }
                    if (pos + 2 + vlen > (int)sizeof(rsp)) break;
                    rsp[1] = 2 + vlen;  /* length per entry */
                    rsp[pos++] = a->handle & 0xFF;
                    rsp[pos++] = (a->handle >> 8) & 0xFF;
                    if (a->uuid16 == UUID_QEMU_RW_CHAR) {
                        memcpy(&rsp[pos], s->rw_char_value, vlen);
                    } else if (a->value && vlen > 0) {
                        memcpy(&rsp[pos], a->value, vlen);
                    }
                    pos += vlen;
                    found = true;
                }
            }
        }
        if (!found) {
            bt_att_error(s, opcode, start, ATT_ERR_ATTR_NOT_FOUND);
        } else {
            bt_send_acl(s, s->conn_handle, L2CAP_CID_ATT, rsp, pos);
        }
        break;
    }

    case ATT_FIND_INFORMATION_REQ: {
        if (att_len < 5) return;
        uint16_t start = att[1] | (att[2] << 8);
        uint16_t end   = att[3] | (att[4] << 8);

        uint8_t rsp[64];
        int pos = 0;
        rsp[pos++] = ATT_FIND_INFORMATION_RSP;
        rsp[pos++] = 0x01;  /* Format: UUID16 */
        bool found = false;

        for (int i = 0; i < GATT_DB_SIZE; i++) {
            if (gatt_db[i].handle >= start &&
                gatt_db[i].handle <= end) {
                if (pos + 4 > (int)sizeof(rsp)) break;
                rsp[pos++] = gatt_db[i].handle & 0xFF;
                rsp[pos++] = (gatt_db[i].handle >> 8) & 0xFF;
                rsp[pos++] = gatt_db[i].uuid16 & 0xFF;
                rsp[pos++] = (gatt_db[i].uuid16 >> 8) & 0xFF;
                found = true;
            }
        }
        if (!found) {
            bt_att_error(s, opcode, start, ATT_ERR_ATTR_NOT_FOUND);
        } else {
            bt_send_acl(s, s->conn_handle, L2CAP_CID_ATT, rsp, pos);
        }
        break;
    }

    case ATT_READ_REQ: {
        if (att_len < 3) return;
        uint16_t handle = att[1] | (att[2] << 8);
        const GattAttr *a = gatt_find_by_handle(handle);
        if (!a) {
            bt_att_error(s, opcode, handle, ATT_ERR_INVALID_HANDLE);
            break;
        }
        uint8_t rsp[64];
        rsp[0] = ATT_READ_RSP;
        int rlen = 1;
        if (a->uuid16 == UUID_QEMU_RW_CHAR) {
            memcpy(&rsp[1], s->rw_char_value, s->rw_char_len);
            rlen += s->rw_char_len;
        } else if (a->uuid16 == UUID_CCC_DESCRIPTOR) {
            rsp[1] = s->notify_ccc & 0xFF;
            rsp[2] = (s->notify_ccc >> 8) & 0xFF;
            rlen += 2;
        } else if (a->uuid16 == UUID_QEMU_NOTIFY_CHAR) {
            /* Return a counter-like value */
            rsp[1] = 0x42;
            rlen += 1;
        } else if (a->value && a->value_len > 0) {
            memcpy(&rsp[1], a->value, MIN(a->value_len, (uint8_t)62));
            rlen += MIN(a->value_len, (uint8_t)62);
        }
        bt_send_acl(s, s->conn_handle, L2CAP_CID_ATT, rsp, rlen);
        break;
    }

    case ATT_WRITE_REQ:
    case ATT_WRITE_CMD: {
        if (att_len < 3) return;
        uint16_t handle = att[1] | (att[2] << 8);
        const uint8_t *wdata = &att[3];
        uint16_t wlen = att_len - 3;

        if (handle == 0x000A) {
            /* R/W characteristic value */
            s->rw_char_len = MIN(wlen, BT_GATT_RW_CHAR_MAX_LEN);
            memcpy(s->rw_char_value, wdata, s->rw_char_len);
        } else if (handle == 0x000D) {
            /* CCC descriptor */
            if (wlen >= 2) {
                s->notify_ccc = wdata[0] | (wdata[1] << 8);
            }
        }
        /* Write Request needs response; Write Command does not */
        if (opcode == ATT_WRITE_REQ) {
            uint8_t rsp[1] = { ATT_WRITE_RSP };
            bt_send_acl(s, s->conn_handle, L2CAP_CID_ATT, rsp, 1);
        }
        break;
    }

    default:
        qemu_log_mask(LOG_UNIMP, "%s: unhandled ATT opcode 0x%02X\n",
                      __func__, opcode);
        bt_att_error(s, opcode, 0x0000, ATT_ERR_UNLIKELY);
        break;
    }
}

/* Process an ACL data packet from the host */
static void bt_acl_process(ESP32S3BtState *s)
{
    if (s->tx_pos < 5) return;  /* H4(1) + ACL_hdr(4) minimum */

