BaiTian6641/qemu/hw/misc/esp32s3_bt.c
    /* Parse ACL header */
    uint16_t acl_hdr = s->tx_buf[1] | (s->tx_buf[2] << 8);
    uint16_t conn_handle = acl_hdr & 0x0FFF;
    uint16_t acl_len = s->tx_buf[3] | (s->tx_buf[4] << 8);
    (void)acl_len;

    if (conn_handle != s->conn_handle || s->conn_handle == 0) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: ACL for unknown handle 0x%04X\n",
                      __func__, conn_handle);
        return;
    }

    /* Parse L2CAP header (4 bytes after ACL header) */
    if (s->tx_pos < 9) return;
    uint16_t l2cap_len = s->tx_buf[5] | (s->tx_buf[6] << 8);
    uint16_t l2cap_cid = s->tx_buf[7] | (s->tx_buf[8] << 8);

    const uint8_t *payload = &s->tx_buf[9];
    uint16_t payload_avail = s->tx_pos - 9;
    uint16_t plen = MIN(l2cap_len, payload_avail);

    if (l2cap_cid == L2CAP_CID_ATT) {
        bt_att_handle(s, payload, plen);
    } else if (l2cap_cid == L2CAP_CID_SMP) {
        /* SMP pairing: stub — send Pairing Failed (not supported) */
        uint8_t rsp[2] = { 0x05, 0x05 };  /* Pairing Failed: Pairing Not Supported */
        bt_send_acl(s, conn_handle, L2CAP_CID_SMP, rsp, 2);
    } else {
        qemu_log_mask(LOG_UNIMP, "%s: unhandled L2CAP CID 0x%04X\n",
                      __func__, l2cap_cid);
    }

    /* Send Number of Completed Packets event */
    {
        uint8_t buf[BT_HCI_RX_BUF_SIZE];
        int pos = 0;
        buf[pos++] = HCI_H4_EVT;
        buf[pos++] = HCI_EVT_NUM_COMP_PKTS;
        buf[pos++] = 5;  /* parameter length */
        buf[pos++] = 1;  /* Num_Handles */
        buf[pos++] = conn_handle & 0xFF;
        buf[pos++] = (conn_handle >> 8) & 0xFF;
        buf[pos++] = 1;  /* Num_Completed = 1 */
        buf[pos++] = 0;
        bt_hci_enqueue_rx(s, buf, pos);
    }
}

/* ================================================================== */
/*  HCI Command Processor                                              */
/* ================================================================== */
static void bt_hci_process_command(ESP32S3BtState *s)
{
    if (s->tx_pos < 4) {
        /* Need at least H4 type(1) + opcode(2) + param_len(1) */
        return;
    }
    if (s->tx_buf[0] == HCI_H4_ACL) {
        /* Route ACL data packets to L2CAP/ATT processing */
        bt_acl_process(s);
        s->int_raw |= BT_HCI_INT_TX_DONE;
        bt_update_irq(s);
        return;
    }
    if (s->tx_buf[0] != HCI_H4_CMD) {
        /* Unknown H4 type; silently accept */
        s->int_raw |= BT_HCI_INT_TX_DONE;
        bt_update_irq(s);
        return;
    }

    uint16_t opcode = s->tx_buf[1] | (s->tx_buf[2] << 8);
    /* uint8_t plen = s->tx_buf[3]; */
    const uint8_t *cmd_params = &s->tx_buf[4];

    switch (opcode) {

    /* ---- Controller & Baseband (OGF=0x03) ---- */
    case HCI_CMD_RESET:
        s->adv_enabled  = false;
        s->scan_enabled = false;
        s->connecting   = false;
        s->conn_handle  = 0;
        s->le_event_mask = 0;
        s->event_mask    = 0x1FFFFFFFFFFF;  /* default */
        if (s->scan_timer) {
            timer_del(s->scan_timer);
        }
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, NULL, 0);
        break;

    case HCI_CMD_SET_EVENT_MASK:
        if (s->tx_pos >= 12) {
            memcpy(&s->event_mask, cmd_params, 8);
        }
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, NULL, 0);
        break;

    /* ---- Informational (OGF=0x04) ---- */
    case HCI_CMD_READ_LOCAL_VERSION: {
        /* HCI_Version=0x09 (BLE 5.0), HCI_Revision=0x0001,
         * LMP_Version=0x09, Manufacturer=0x02E5 (Espressif),
         * LMP_Subversion=0x0001 */
        uint8_t p[8] = {0x09, 0x01, 0x00, 0x09, 0xE5, 0x02, 0x01, 0x00};
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, p, 8);
        break;
    }

    case HCI_CMD_READ_BD_ADDR: {
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, s->bd_addr, 6);
        break;
    }

    case HCI_CMD_READ_LOCAL_COMMANDS: {
        /* Return a supported commands bitmask (simplified) */
        uint8_t p[64];
        memset(p, 0, 64);
        /* Byte 0: Inquiry not supported; Byte 14: LE commands */
        p[14] = 0xFF; /* LE Set Event Mask thru LE Set Scan Enable */
        p[25] = 0x0F; /* LE basic commands */
        p[26] = 0x0F;
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, p, 64);
        break;
    }

    case HCI_CMD_READ_LOCAL_FEATURES: {
        /* LMP features page 0: indicate LE support */
        uint8_t p[8] = {0x00, 0x00, 0x00, 0x00, 0x60, 0x00, 0x00, 0x00};
        /* Bit 37 = LE Supported (Host), Bit 38 = BR/EDR not supported */
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, p, 8);
        break;
    }

    /* ---- LE Controller (OGF=0x08) ---- */
    case HCI_CMD_LE_SET_EVENT_MASK:
        if (s->tx_pos >= 12) {
            memcpy(&s->le_event_mask, cmd_params, 8);
        }
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, NULL, 0);
        break;

    case HCI_CMD_LE_READ_BUFFER_SIZE: {
        /* LE_ACL_Data_Packet_Length=251, Total_Num=8 */
        uint8_t p[3] = {0xFB, 0x00, 0x08};
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, p, 3);
        break;
    }

    case HCI_CMD_LE_READ_LOCAL_FEAT: {
        /* LE Features: bit0=LE Encryption, bit5=LE Data Packet Len Ext */
        uint8_t p[8] = {0x21, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, p, 8);
        break;
    }

    case HCI_CMD_LE_SET_RANDOM_ADDR:
        if (s->tx_pos >= 10) {
            memcpy(s->random_addr, cmd_params, 6);
        }
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, NULL, 0);
        break;

    case HCI_CMD_LE_SET_ADV_PARAMS:
        /* Just accept — parameters stored (interval, type, etc.) */
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, NULL, 0);
        break;

    case HCI_CMD_LE_READ_ADV_TX_POWER: {
        uint8_t p[1] = {0};  /* 0 dBm */
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, p, 1);
        break;
    }

    case HCI_CMD_LE_SET_ADV_DATA:
        if (s->tx_pos >= 5) {
            s->adv_data_len = MIN(cmd_params[0], 31);
            memcpy(s->adv_data, &cmd_params[1], s->adv_data_len);
        }
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, NULL, 0);
        break;

    case HCI_CMD_LE_SET_SCAN_RSP_DATA:
        if (s->tx_pos >= 5) {
            s->scan_rsp_len = MIN(cmd_params[0], 31);
            memcpy(s->scan_rsp_data, &cmd_params[1], s->scan_rsp_len);
        }
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, NULL, 0);
        break;

    case HCI_CMD_LE_SET_ADV_ENABLE:
        if (s->tx_pos >= 5) {
            s->adv_enabled = (cmd_params[0] != 0);
        }
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, NULL, 0);
        break;

    case HCI_CMD_LE_SET_SCAN_PARAMS:
        if (s->tx_pos >= 11) {
            s->scan_type     = cmd_params[0];
            s->scan_interval = cmd_params[1] | (cmd_params[2] << 8);
            s->scan_window   = cmd_params[3] | (cmd_params[4] << 8);
        }
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, NULL, 0);
        break;

    case HCI_CMD_LE_SET_SCAN_ENABLE:
        if (s->tx_pos >= 5) {
            bool enable = (cmd_params[0] != 0);
            s->scan_enabled = enable;
            if (enable) {
                /* Start generating periodic advertising reports from virtual peer */
                timer_mod(s->scan_timer,
                          qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 50 * SCALE_MS);
            } else {
                timer_del(s->scan_timer);
            }
        }
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, NULL, 0);
        break;

    case HCI_CMD_LE_CREATE_CONN: {
        /* Immediately respond with Command Status (pending), then
         * generate LE Connection Complete event from virtual peer */
        bt_send_cmd_status(s, opcode, HCI_SUCCESS);
        s->connecting = true;

        /* Generate LE Connection Complete after a short delay.
         * For immediate MVP, we do it synchronously. */
        s->conn_handle = 0x0001;  /* deterministic handle */
        uint8_t p[18];
        memset(p, 0, sizeof(p));
        p[0] = HCI_SUCCESS;          /* Status */
        p[1] = 0x01; p[2] = 0x00;    /* Connection_Handle = 0x0001 */
        p[3] = 0x01;                  /* Role: Peripheral = 1 (we initiated as Central) → 0x00 = Central */
        p[3] = 0x00;                  /* Role: Central */
        p[4] = 0x01;                  /* Peer_Address_Type: Random */
        /* Peer address */
        p[5] = 0x02; p[6] = 0x00; p[7] = 0x00;
        p[8] = 0x00; p[9] = 0x00; p[10] = 0x02;
        p[11] = 0x18; p[12] = 0x00;  /* Conn_Interval = 24 (30ms) */
        p[13] = 0x00; p[14] = 0x00;  /* Peripheral_Latency = 0 */
        p[15] = 0xC8; p[16] = 0x00;  /* Supervision_Timeout = 200 (2s) */
        p[17] = 0x00;                 /* Central_Clock_Accuracy = 0 */
        bt_send_le_meta(s, HCI_LE_EVT_CONN_COMPLETE, p, 18);
        s->connecting = false;
        break;
    }

