BaiTian6641/qemu/hw/misc/esp32s3_bt.c
    case HCI_CMD_LE_CREATE_CONN_CANCEL:
        s->connecting = false;
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, NULL, 0);
        break;

    case HCI_CMD_LE_READ_FILTER_LIST_SIZE: {
        uint8_t p[1] = {8};   /* Filter list size = 8 */
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, p, 1);
        break;
    }

    case HCI_CMD_LE_READ_SUPP_STATES: {
        /* All LE states supported (bits 0-41) */
        uint8_t p[8] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x03, 0x00, 0x00};
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, p, 8);
        break;
    }

    case HCI_CMD_LE_SET_DATA_LENGTH: {
        /* Accept any data length parameters */
        uint8_t p[2] = {0x01, 0x00};  /* Connection_Handle */
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, p, 2);
        break;
    }

    case HCI_CMD_LE_READ_MAX_DATA_LEN: {
        /* Supported_Max_TX/RX_Octets=251, Time=2120 */
        uint8_t p[8] = {0xFB, 0x00, 0x48, 0x08,
                         0xFB, 0x00, 0x48, 0x08};
        bt_send_cmd_complete(s, opcode, HCI_SUCCESS, p, 8);
        break;
    }

    /* ---- Link Control (OGF=0x01) ---- */
    case HCI_CMD_DISCONNECT: {
        if (s->conn_handle) {
            uint16_t ch = cmd_params[0] | (cmd_params[1] << 8);
            uint8_t reason = cmd_params[2];
            /* Send Command Status (pending) */
            bt_send_cmd_status(s, opcode, HCI_SUCCESS);
            /* Then Disconnection Complete event */
            uint8_t ev[BT_HCI_RX_BUF_SIZE];
            int epos = 0;
            ev[epos++] = HCI_H4_EVT;
            ev[epos++] = HCI_EVT_DISCONN_COMPLETE;
            ev[epos++] = 4;  /* param length */
            ev[epos++] = HCI_SUCCESS;
            ev[epos++] = ch & 0xFF;
            ev[epos++] = (ch >> 8) & 0xFF;
            ev[epos++] = reason;
            bt_hci_enqueue_rx(s, ev, epos);
            s->conn_handle = 0;
        } else {
            bt_send_cmd_status(s, opcode, 0x02); /* No Connection */
        }
        /* TX done already signaled by cmd_status path; skip normal path */
        goto tx_done;
    }

    case HCI_CMD_LE_CONN_UPDATE: {
        /* Accept any connection parameter update */
        bt_send_cmd_status(s, opcode, HCI_SUCCESS);
        /* Send LE Connection Update Complete event */
        if (s->conn_handle) {
            uint16_t ch = cmd_params[0] | (cmd_params[1] << 8);
            uint16_t interval = cmd_params[2] | (cmd_params[3] << 8);
            uint16_t latency  = cmd_params[4] | (cmd_params[5] << 8);
            uint16_t timeout  = cmd_params[6] | (cmd_params[7] << 8);
            uint8_t ev[BT_HCI_RX_BUF_SIZE];
            int epos = 0;
            ev[epos++] = HCI_H4_EVT;
            ev[epos++] = HCI_EVT_LE_META;
            ev[epos++] = 10;  /* param length */
            ev[epos++] = 0x03;  /* LE Connection Update Complete */
            ev[epos++] = HCI_SUCCESS;
            ev[epos++] = ch & 0xFF;
            ev[epos++] = (ch >> 8) & 0xFF;
            ev[epos++] = interval & 0xFF;
            ev[epos++] = (interval >> 8) & 0xFF;
            ev[epos++] = latency & 0xFF;
            ev[epos++] = (latency >> 8) & 0xFF;
            ev[epos++] = timeout & 0xFF;
            ev[epos++] = (timeout >> 8) & 0xFF;
            bt_hci_enqueue_rx(s, ev, epos);
        }
        goto tx_done;
    }

    default:
        /* Unknown command — respond with Command Complete + error status */
        qemu_log_mask(LOG_UNIMP,
                      "%s: unhandled HCI command 0x%04X\n", __func__, opcode);
        bt_send_cmd_complete(s, opcode, HCI_ERR_UNKNOWN_CMD, NULL, 0);
        break;
    }

    /* Signal TX done */
tx_done:
    s->int_raw |= BT_HCI_INT_TX_DONE;
    bt_update_irq(s);
}

/* ================================================================== */
/*  QEMU HCI Transport register read/write                            */
/* ================================================================== */
static uint64_t bt_hci_reg_read(ESP32S3BtState *s, hwaddr offset)
{
    switch (offset) {
    case BT_QEMU_HCI_STATUS: {
        uint32_t val = 0;
        val |= 1;                          /* bit0: TX always available */
        if (s->rx_count > 0)  val |= (1 << 1);     /* bit1: RX pending */
        if (s->controller_ready) val |= (1 << 2);    /* bit2: ctrl ready */
        val |= (s->rx_count & 0xFF) << 8;             /* [15:8]: RX count */
        return val;
    }

    case BT_QEMU_HCI_RX_LEN: {
        BtHciRxPacket *head = QTAILQ_FIRST(&s->rx_queue);
        return head ? head->len : 0;
    }

    case BT_QEMU_HCI_RX_DATA: {
        BtHciRxPacket *head = QTAILQ_FIRST(&s->rx_queue);
        if (!head || s->rx_read_pos >= head->len) {
            return 0;
        }
        /* Read up to 4 bytes (word aligned) */
        uint32_t val = 0;
        for (int i = 0; i < 4 && (s->rx_read_pos + i) < head->len; i++) {
            val |= (uint32_t)head->data[s->rx_read_pos + i] << (i * 8);
        }
        s->rx_read_pos += 4;
        return val;
    }

    case BT_QEMU_HCI_INT_RAW:
        return s->int_raw;

    case BT_QEMU_HCI_INT_ST:
        return s->int_raw & s->int_ena;

    case BT_QEMU_HCI_INT_ENA:
        return s->int_ena;

    case BT_QEMU_HCI_VERSION:
        return BT_QEMU_HCI_VERSION_VAL;

    case BT_QEMU_HCI_MAGIC:
        return BT_QEMU_HCI_MAGIC_VALUE;

    default:
        return 0;
    }
}

static void bt_hci_reg_write(ESP32S3BtState *s, hwaddr offset, uint64_t value)
{
    switch (offset) {
    case BT_QEMU_HCI_TX_LEN:
        s->tx_len = (uint16_t)value;
        s->tx_pos = 0;
        break;

    case BT_QEMU_HCI_TX_DATA: {
        /* Write up to 4 bytes into TX buffer */
        for (int i = 0; i < 4 && s->tx_pos < BT_HCI_TX_BUF_SIZE; i++) {
            s->tx_buf[s->tx_pos++] = (value >> (i * 8)) & 0xFF;
        }
        break;
    }

    case BT_QEMU_HCI_TX_PUSH:
        if (value & 1) {
            bt_hci_process_command(s);
            /* Reset TX buffer for next packet */
            s->tx_pos = 0;
            s->tx_len = 0;
        }
        break;

