BaiTian6641/qemu/hw/misc/esp32s3_bt.c
    case BT_QEMU_HCI_RX_POP:
        if (value & 1) {
            BtHciRxPacket *head = QTAILQ_FIRST(&s->rx_queue);
            if (head) {
                QTAILQ_REMOVE(&s->rx_queue, head, entry);
                g_free(head);
                s->rx_count--;
                s->rx_read_pos = 0;
            }
            /* Clear RX_READY if queue is now empty */
            if (s->rx_count == 0) {
                s->int_raw &= ~BT_HCI_INT_RX_READY;
            }
            bt_update_irq(s);
        }
        break;

    case BT_QEMU_HCI_CTRL: {
        bool enable = (value & BIT(0)) != 0;
        bool reset  = (value & BIT(1)) != 0;
        s->ble_mode = (value >> 2) & 0x3;

        if (reset) {
            s->adv_enabled  = false;
            s->scan_enabled = false;
            s->connecting   = false;
            s->conn_handle  = 0;
            if (s->scan_timer) {
                timer_del(s->scan_timer);
            }
        }
        if (enable && !s->controller_ready) {
            s->controller_ready = true;
            s->int_raw |= BT_HCI_INT_CTRL_READY;
            bt_update_irq(s);
        }
        if (!enable) {
            s->controller_ready = false;
        }
        break;
    }

    case BT_QEMU_HCI_INT_ENA:
        s->int_ena = (uint32_t)value;
        bt_update_irq(s);
        break;

    case BT_QEMU_HCI_INT_CLR:
        s->int_raw &= ~(uint32_t)value;
        bt_update_irq(s);
        break;

    default:
        break;
    }
}

/* ================================================================== */
/*  Top-level MMIO read/write                                          */
/* ================================================================== */
static uint64_t esp32s3_bt_read(void *opaque, hwaddr addr, unsigned int size)
{
    ESP32S3BtState *s = ESP32S3_BT(opaque);

    if (addr >= 0xF00 && addr <= 0xFFF) {
        /* QEMU HCI transport registers */
        return bt_hci_reg_read(s, addr);
    }

    /* Generic blob register store (0x000 – 0xEFF) */
    uint32_t idx = addr / 4;
    if (idx < ESP32S3_BT_BLOB_REG_COUNT) {
        return s->blob_regs[idx];
    }
    return 0;
}

static void esp32s3_bt_write(void *opaque, hwaddr addr,
                             uint64_t value, unsigned int size)
{
    ESP32S3BtState *s = ESP32S3_BT(opaque);

    if (addr >= 0xF00 && addr <= 0xFFF) {
        /* QEMU HCI transport registers */
        bt_hci_reg_write(s, addr, value);
        return;
    }

    /* Generic blob register store */
    uint32_t idx = addr / 4;
    if (idx < ESP32S3_BT_BLOB_REG_COUNT) {
        s->blob_regs[idx] = (uint32_t)value;
    }
}

static const MemoryRegionOps esp32s3_bt_ops = {
    .read  = esp32s3_bt_read,
    .write = esp32s3_bt_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .impl.min_access_size = 4,
    .impl.max_access_size = 4,
};

/* ================================================================== */
/*  Device lifecycle                                                   */
/* ================================================================== */
static void esp32s3_bt_init(Object *obj)
{
    ESP32S3BtState *s = ESP32S3_BT(obj);
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);

    memory_region_init_io(&s->iomem, obj, &esp32s3_bt_ops, s,
                          TYPE_ESP32S3_BT, ESP32S3_BT_REG_SIZE);
    sysbus_init_mmio(sbd, &s->iomem);

    /* 7 IRQ lines */
    qdev_init_gpio_out_named(DEVICE(obj), s->irq, ESP32S3_BT_IRQ_NAME,
                             ESP32S3_BT_IRQ_COUNT);

    QTAILQ_INIT(&s->rx_queue);
}

static void esp32s3_bt_realize(DeviceState *dev, Error **errp)
{
    ESP32S3BtState *s = ESP32S3_BT(dev);

    /* Create scan timer for virtual peer advertising reports */
    s->scan_timer = timer_new_ns(QEMU_CLOCK_VIRTUAL, bt_scan_timer_cb, s);
}

static void esp32s3_bt_reset_hold(Object *obj, ResetType type)
{
    ESP32S3BtState *s = ESP32S3_BT(obj);

    /* Clear blob register store */
    memset(s->blob_regs, 0, sizeof(s->blob_regs));

    /* Reset HCI transport state */
    s->controller_ready = false;
    s->ble_mode = 0;
    s->tx_len = 0;
    s->tx_pos = 0;
    s->rx_read_pos = 0;
    s->int_raw = 0;
    s->int_ena = 0;

    /* Drain RX queue */
    BtHciRxPacket *pkt, *tmp;
    QTAILQ_FOREACH_SAFE(pkt, &s->rx_queue, entry, tmp) {
        QTAILQ_REMOVE(&s->rx_queue, pkt, entry);
        g_free(pkt);
    }
    s->rx_count = 0;

    /* Reset BLE state */
    s->adv_enabled  = false;
    s->scan_enabled = false;
    s->connecting   = false;
    s->conn_handle  = 0;
    s->adv_data_len = 0;
    s->scan_rsp_len = 0;
    s->le_event_mask = 0;
    s->event_mask    = 0x1FFFFFFFFFFF;
    s->num_hci_cmd_pkts = 1;

    /* Deterministic BD_ADDR for QEMU */
    s->bd_addr[0] = 0x60;
    s->bd_addr[1] = 0x55;
    s->bd_addr[2] = 0xF9;
    s->bd_addr[3] = 0xF6;
    s->bd_addr[4] = 0x03;
    s->bd_addr[5] = 0x00;
    memset(s->random_addr, 0, 6);

    /* Reset GATT state */
    s->att_mtu = 23;
    s->rw_char_len = 0;
    memset(s->rw_char_value, 0, sizeof(s->rw_char_value));
    s->notify_ccc = 0;

    if (s->scan_timer) {
        timer_del(s->scan_timer);
    }

    /* Lower all IRQs */
    for (int i = 0; i < ESP32S3_BT_IRQ_COUNT; i++) {
        qemu_set_irq(s->irq[i], 0);
    }
}

static void esp32s3_bt_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    ResettableClass *rc = RESETTABLE_CLASS(klass);

    dc->realize = esp32s3_bt_realize;
    rc->phases.hold = esp32s3_bt_reset_hold;
}

static const TypeInfo esp32s3_bt_info = {
    .name          = TYPE_ESP32S3_BT,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(ESP32S3BtState),
    .instance_init = esp32s3_bt_init,
    .class_init    = esp32s3_bt_class_init,
};

static void esp32s3_bt_register_types(void)
{
    type_register_static(&esp32s3_bt_info);
}

type_init(esp32s3_bt_register_types);
